channelReTau110/template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/caseSettings"

solvers
{
    p
    {
        solver           $:fvSolution.solvers.p.solver;

	smoother         $:fvSolution.solvers.p.smoother; // for GAMG

        preconditioner   $:fvSolution.solvers.p.preconditioner; // for PCG

        agglomerator     faceAreaPair;
	mergeLevels      1;
        nCellsInCoarsestLevel 100;

        tolerance        1e-6;
	relTol           0.05;
    };

    pFinal
    {
        $p;
        relTol           0;
    }

    "(U|k)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
