channelReTau110/template/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/caseSettings"

numberOfSubdomains $:decomposeParDict.numberOfSubdomains;

preservePatches ( sides_half0 sides_half1 inout_half0 inout_half1 );

method          $:decomposeParDict.method;

simpleCoeffs
{
  n           (
	       $:decomposeParDict.simpleCoeffs.nx
	       $:decomposeParDict.simpleCoeffs.ny
	       $:decomposeParDict.simpleCoeffs.nz
	       );
  delta       0.001;
}

scotchCoeffs
{
}

// ************************************************************************* //
