channelReTau110/template/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

./Allrun.pre
./Allrun.solve
./Allrun.post
./Allrun.plot

# ----------------------------------------------------------------- end-of-file

