channelReTau110/template/Allrun.post
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication foamLog log.$(getApplication)

runApplication reconstructPar -latestTime

runApplication postChannel -latestTime


# ----------------------------------------------------------------- end-of-file

